app/controllers/home_controller.rb

SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`ID` = 0 LIMIT 1
UPDATE `contacts` SET `Name` = NULL, `Email` = NULL, `Add_1` = NULL, `Town` = NULL, `Postcode` = NULL, `Phone` = NULL, `DOB` = NULL WHERE `contacts`.`ID` = 1
---
	def put_contact
		contact = Contact.find(params['id'])

		if contact then
			contact.Name = params['Name']
			contact.Email = params['Email']
			contact.Add_1 = params['Add_1']
			contact.Add_2 = params['Add_2']
			contact.Town = params['Town']
			contact.Postcode = params['Postcode']
			contact.Phone = params['Phone']
			contact.DOB = params['DOB']
			contact.save

INSERT INTO `contacts` (`Name`, `Email`, `Add_1`, `Add_2`, `Town`, `Postcode`, `Phone`) VALUES ('Rosie', 'rosie@rosie.com', '234 Any Street', 'p', 'Bath', 'BA1 2AB', '01234567890')
---
	def post_contact
		contact = Contact.new
		contact.Name = params['Name']
		contact.Email = params['Email']
		contact.Add_1 = params['Add_1']
		contact.Add_2 = params['Add_2']
		contact.Town = params['Town']
		contact.Postcode = params['Postcode']
		contact.Phone = params['Phone']
		contact.DOB = params['DOB']
		contact.save

SELECT `contacts`.* FROM `contacts`
---
	def get_contacts
		render json: Contact.all, layout: false

SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`ID` = 11 LIMIT 1
DELETE FROM `contacts` WHERE `contacts`.`ID` = 11
---
	def delete_contact
		contact = Contact.find(params['id'])
		if contact then
			contact.delete